examples/taylor_couette/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
(0.5 0  -0.5)
(0 -0.5 -0.5)
(-0.5 0 -0.5)
(0 0.5  -0.5)
(1 0    -0.5)
(0 -1   -0.5)
(-1 0   -0.5)
(0 1    -0.5)

(0.5 0  0.5)
(0 -0.5 0.5)
(-0.5 0 0.5)
(0 0.5  0.5)
(1 0    0.5)
(0 -1   0.5)
(-1 0   0.5)
(0 1    0.5)
);


blocks          
(
    hex (8 9 10 11 0 1 2 3)   (50 50 1) simpleGrading (1 1 1)
    hex (8 12 13 9 0 4 5 1)   (50 50 1) simpleGrading (1 1 1)
    hex (9 13 14 10 1 5 6 2)  (50 50 1) simpleGrading (1 1 1)
    hex (10 14 15 11 2 6 7 3) (50 50 1) simpleGrading (1 1 1)
    hex (11 15 12 8 3 7 4 0)  (50 50 1) simpleGrading (1 1 1)
);

edges
(
    arc 4 5 (0.707 -0.707  -0.5)
    arc 5 6 (-0.707 -0.707  -0.5)
    arc 6 7 (-0.707 0.707  -0.5)
    arc 7 4 (0.707 0.707  -0.5)
    arc 12 13 (0.707 -0.707  0.5)
    arc 13 14 (-0.707 -0.707 0.5)
    arc 14 15 (-0.707 0.707  0.5)
    arc 15 12 (0.707 0.707   0.5)
);

boundary
(
    Top
    {
        type empty;
        faces
        (
            (8 11 10 9)
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (11 8 12 15)
        );
    }
    Btm
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)
        );
    }
    Cyl
    {
        type wall;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (7 15 12 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
